20260131135705-kavnai_trek_31_jan_2026.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 08:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>kavnai trek 31 jan 2026</title>
<meta name="author" content="Vipul" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">kavnai trek 31 jan 2026</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2649dde">Schedule</a>
<ul>
<li><a href="#org8790399">went with 4 people today - anil pethkar, bapu sonje, nandkumar kashelani</a></li>
<li><a href="#org010b59a">woke at 5</a></li>
<li><a href="#org12d565a">bath done at 5.35</a></li>
<li><a href="#orge6af6b6">left home by 6.05</a></li>
<li><a href="#org88fef41">left hdfc bank chandak Circle by 6.25 with bapu sonje</a></li>
<li><a href="#orgcb7df53">reached and left decathlon by 6.42 am</a></li>
<li><a href="#org50e6939">Datta Mandir</a></li>
<li><a href="#org42c082b">kamakshi mandir</a></li>
<li><a href="#orgef3d5d4">started at 7.23</a></li>
</ul>
</li>
<li><a href="#orgd3c8d1d">kamakshi devi mandir</a></li>
<li><a href="#org2083ef4">on da patta</a></li>
<li><a href="#org8796ea3">vishramgadh</a></li>
<li><a href="#org60f298c">information</a></li>
<li><a href="#orgc645c7f">facts</a></li>
<li><a href="#org92baca8">route to take from nashik -</a></li>
<li><a href="#org80410b4">experience -</a></li>
<li><a href="#orgd076b4f">an easy trek for beginners.</a></li>
<li><a href="#org711186b">not to miss</a>
<ul>
<li><a href="#orgcfa9479">door at the entrance north side.</a></li>
<li><a href="#org90ff825">small caves</a></li>
<li><a href="#org3ccd37a">kavnai devi temple</a></li>
<li><a href="#orge0bdadf">buruj and historical remains on south side</a></li>
<li><a href="#org146934e">water tank</a></li>
<li><a href="#orgdc0b09a">temple of shiva with nandi in fron.</a></li>
<li><a href="#org3fc3a58">bastion on west side.</a></li>
<li><a href="#org10136e2">view of vaitarnadam / mukne dam.</a></li>
</ul>
</li>
<li><a href="#orge5af632">kavnai village near ghoti - 250 houses.</a></li>
<li><a href="#org3493b5a">kapildhara gajanan maharaj mandir.</a>
<ul>
<li><a href="#org6fc9ddf">food facility at kapildhara gajana maharaj mandir as prasadam from 10 am to 6.30 pm daily.</a></li>
</ul>
</li>
<li><a href="#org081ba37">no facilty at for</a></li>
<li><a href="#orgd475d00">major foodcrops here are rice and barley.</a></li>
<li><a href="#org30e5e51">auto repair at ghoti</a></li>
<li><a href="#org1bcb555">petrol at ghoti and igatpuri.</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2649dde" class="outline-2">
<h2 id="org2649dde">Schedule</h2>
<div class="outline-text-2" id="text-org2649dde">
</div>
<div id="outline-container-org8790399" class="outline-3">
<h3 id="org8790399">went with 4 people today - anil pethkar, bapu sonje, nandkumar kashelani</h3>
</div>
<div id="outline-container-org010b59a" class="outline-3">
<h3 id="org010b59a">woke at 5</h3>
</div>
<div id="outline-container-org12d565a" class="outline-3">
<h3 id="org12d565a">bath done at 5.35</h3>
</div>
<div id="outline-container-orge6af6b6" class="outline-3">
<h3 id="orge6af6b6">left home by 6.05</h3>
</div>
<div id="outline-container-org88fef41" class="outline-3">
<h3 id="org88fef41">left hdfc bank chandak Circle by 6.25 with bapu sonje</h3>
</div>
<div id="outline-container-orgcb7df53" class="outline-3">
<h3 id="orgcb7df53">reached and left decathlon by 6.42 am</h3>
</div>
<div id="outline-container-org50e6939" class="outline-3">
<h3 id="org50e6939">Datta Mandir</h3>
</div>
<div id="outline-container-org42c082b" class="outline-3">
<h3 id="org42c082b">kamakshi mandir</h3>
</div>
<div id="outline-container-orgef3d5d4" class="outline-3">
<h3 id="orgef3d5d4">started at 7.23</h3>
</div>
</div>
<div id="outline-container-orgd3c8d1d" class="outline-2">
<h2 id="orgd3c8d1d">kamakshi devi mandir</h2>
</div>
<div id="outline-container-org2083ef4" class="outline-2">
<h2 id="org2083ef4">on da patta</h2>
</div>
<div id="outline-container-org8796ea3" class="outline-2">
<h2 id="org8796ea3">vishramgadh</h2>
</div>
<div id="outline-container-org60f298c" class="outline-2">
<h2 id="org60f298c">information</h2>
<div class="outline-text-2" id="text-org60f298c">
<p>
राज्याभिषेक सोहळ्यानंतर (स्वराज्य) स्थापन झाले. अशी एक श्रद्धा आहे की शिवाजी महाराजांनी गुप्तपणे या किल्ल्याला भेट दिली होती.
</p>

<p>
जवळचे धार्मिक स्थळ, कपिलधार तीर्थ, महान संत ज्ञानेश्वर आणि गजानन महाराज यांच्या पदस्पर्शाने पवित्र झाले.
</p>

<p>
रामायणाच्या काळात, भगवान हनुमान द्रोणागिरी पर्वत घेऊन जात असताना 'कालनेमी' नावाच्या राक्षसाने त्यांचे लक्ष विचलित केले होते. भगवान हनुमानांनी याच पर्वतावर त्या राक्षसाचा वध केला. म्हणूनच या पर्वताला हे नाव पडले.
</p>

<p>
कवनई हे ऐतिहासिक आणि वारसा स्मृतींना उजाळा देते.
</p>
</div>
</div>
<div id="outline-container-orgc645c7f" class="outline-2">
<h2 id="orgc645c7f">facts</h2>
<div class="outline-text-2" id="text-orgc645c7f">
<p>
type of fort? - hill fort
best season - winter summer rainy
</p>

<p>
Way to the fort: Climbing from a pathway at the South of Kavnai village
</p>

<p>
Time to climb: 2 hours / half day trek
</p>

<p>
Difficulty level: Easy
</p>

<p>
Spread: Medium
</p>

<p>
Water availability: Not suitable for drinking
</p>

<p>
Carry along: No special equipments
</p>

<p>
Guide: Not necessary
Details
</p>

<p>
Region: Igatpuri
</p>

<p>
Base Village: Kavnai
</p>

<p>
Distance from Nashik: 40 km
</p>

<p>
Range: Igatpuri range, Sahyadri Sub-range
</p>

<p>
Height: 2998 ft. from M.S.L
</p>
</div>
</div>
<div id="outline-container-org92baca8" class="outline-2">
<h2 id="org92baca8">route to take from nashik -</h2>
<div class="outline-text-2" id="text-org92baca8">
<p>
from nashik - ghoti road - turn right to vaitarnadam road - from waaki village 1.5km turn right - kavnaigaon will be reached after 4.5km.
</p>
</div>
</div>
<div id="outline-container-org80410b4" class="outline-2">
<h2 id="org80410b4">experience -</h2>
<div class="outline-text-2" id="text-org80410b4">
<p>
cool breeze over the massive fort makes you relish every moment spent here. it is a small fort with a temple and the clear waters of the lake dotting the  ladscape. the temple of the goddess kamakshi reflects in the clear waters and so do the clouds in the sky aobve. a shivling with a nandi in front is a temple beside the lake.
</p>

<p>
there is one cave which is at the right side on the top of the fort. there is one bastion on west side of the fort. one can see the kalsubai range, trimbak range, tringalwadi and otehr forts from the top of this fort. the rays reflected in the clear water of upper vaitarna dam leaves one awestruck.
</p>

<p>
iron adder now for vonvenient climbing to reach the entrance door. 
</p>
</div>
</div>
<div id="outline-container-orgd076b4f" class="outline-2">
<h2 id="orgd076b4f">an easy trek for beginners.</h2>
</div>
<div id="outline-container-org711186b" class="outline-2">
<h2 id="org711186b">not to miss</h2>
<div class="outline-text-2" id="text-org711186b">
</div>
<div id="outline-container-orgcfa9479" class="outline-3">
<h3 id="orgcfa9479">door at the entrance north side.</h3>
</div>
<div id="outline-container-org90ff825" class="outline-3">
<h3 id="org90ff825">small caves</h3>
</div>
<div id="outline-container-org3ccd37a" class="outline-3">
<h3 id="org3ccd37a">kavnai devi temple</h3>
</div>
<div id="outline-container-orge0bdadf" class="outline-3">
<h3 id="orge0bdadf">buruj and historical remains on south side</h3>
</div>
<div id="outline-container-org146934e" class="outline-3">
<h3 id="org146934e">water tank</h3>
</div>
<div id="outline-container-orgdc0b09a" class="outline-3">
<h3 id="orgdc0b09a">temple of shiva with nandi in fron.</h3>
</div>
<div id="outline-container-org3fc3a58" class="outline-3">
<h3 id="org3fc3a58">bastion on west side.</h3>
</div>
<div id="outline-container-org10136e2" class="outline-3">
<h3 id="org10136e2">view of vaitarnadam / mukne dam.</h3>
</div>
</div>
<div id="outline-container-orge5af632" class="outline-2">
<h2 id="orge5af632">kavnai village near ghoti - 250 houses.</h2>
</div>
<div id="outline-container-org3493b5a" class="outline-2">
<h2 id="org3493b5a">kapildhara gajanan maharaj mandir.</h2>
<div class="outline-text-2" id="text-org3493b5a">
</div>
<div id="outline-container-org6fc9ddf" class="outline-3">
<h3 id="org6fc9ddf">food facility at kapildhara gajana maharaj mandir as prasadam from 10 am to 6.30 pm daily.</h3>
</div>
</div>
<div id="outline-container-org081ba37" class="outline-2">
<h2 id="org081ba37">no facilty at for</h2>
</div>
<div id="outline-container-orgd475d00" class="outline-2">
<h2 id="orgd475d00">major foodcrops here are rice and barley.</h2>
</div>
<div id="outline-container-org30e5e51" class="outline-2">
<h2 id="org30e5e51">auto repair at ghoti</h2>
</div>
<div id="outline-container-org1bcb555" class="outline-2">
<h2 id="org1bcb555">petrol at ghoti and igatpuri.</h2>
</div>
</div>
</body>
</html>